STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/BLE/BLE_DataThroughput/STM32_WPAN/App/app_ble.c
#if(CFG_BLE_CENTRAL != 0)
          APP_DBG_MSG("EVT_LE_CONN_COMPLETE connection as master\n");
#endif
          Connection_Interval = connection_complete_event->Conn_Interval * 1.25;
          
          APP_DBG_MSG("EVT_LE_CONN_COMPLETE connection as slave\n");
          APP_DBG_MSG("interval= %.2f ms \n",Connection_Interval);
          APP_DBG_MSG("latency= 0x%x \n",connection_complete_event->Conn_Latency);
          Supervision_Timeout = connection_complete_event->Supervision_Timeout * 10;
          APP_DBG_MSG("supervision_timeout= %.2f ms \n",Supervision_Timeout);
          
          UTIL_SEQ_SetTask(1 << CFG_TASK_LINK_CONFIG_ID, CFG_SCH_PRIO_0);
          break; /* HCI_EVT_LE_CONN_COMPLETE */

        case EVT_LE_CONN_UPDATE_COMPLETE:
          mutex = 1;
          connection_update_complete = (hci_le_connection_update_complete_event_rp0*)meta_evt->data;
          
          APP_DBG_MSG("EVT_LE_CONN_UPDATE_COMPLETE \n");
          Connection_Interval = connection_update_complete->Conn_Interval * 1.25;
          APP_DBG_MSG("interval= %.2f ms \n",Connection_Interval);
          APP_DBG_MSG("latency= 0x%x \n",connection_update_complete->Conn_Latency);
          Supervision_Timeout = connection_update_complete->Supervision_Timeout * 10;
          APP_DBG_MSG("supervision_timeout= %.2f ms \n",Supervision_Timeout);
                           
          break;
          
        case EVT_LE_ADVERTISING_REPORT:

          le_advertising_event = (hci_le_advertising_report_event_rp0 *) meta_evt->data;

          event_type = le_advertising_event->Advertising_Report[0].Event_Type;

          event_data_size = le_advertising_event->Advertising_Report[0].Length_Data;

          adv_report_data = (uint8_t*)(&le_advertising_event->Advertising_Report[0].Length_Data) + 1;
          k = 0;

          /* search AD TYPE AD_TYPE_COMPLETE_LOCAL_NAME (Complete Local Name) */
          /* search AD Type AD_TYPE_16_BIT_SERV_UUID (16 bits UUIDS) */
          if (event_type == ADV_IND)
          {
            /*ISOLATION OF BD ADDRESS AND LOCAL NAME*/
            while(k < event_data_size)
            {
              adlength = adv_report_data[k];
              adtype = adv_report_data[k + 1];
              switch (adtype)
              {
                case AD_TYPE_FLAGS: /* now get flags */
                  break;

                case AD_TYPE_TX_POWER_LEVEL: /* Tx power level */
                  break;

                case AD_TYPE_MANUFACTURER_SPECIFIC_DATA: /* Manufacturer Specific */
                  if (adlength >= 7 && adv_report_data[k + 2] == 0x01)
                  { /* ST VERSION ID 01 */
                    APP_DBG_MSG("--- ST MANUFACTURER ID --- \n");
                    switch (adv_report_data[k + 3])
                    {   /* Demo ID */
                      case CFG_DEV_ID_PERIPH_SERVER:   /* (Periph Server DT) */
                        APP_DBG_MSG("-- SERVER DETECTED -- VIA MAN ID\n");
                        BleApplicationContext.DeviceServerFound = AT_LEAST_ONE_DEVICE_FOUND;
                        SERVER_REMOTE_BDADDR[0] = le_advertising_event->Advertising_Report[0].Address[0];
                        SERVER_REMOTE_BDADDR[1] = le_advertising_event->Advertising_Report[0].Address[1];
                        SERVER_REMOTE_BDADDR[2] = le_advertising_event->Advertising_Report[0].Address[2];
                        SERVER_REMOTE_BDADDR[3] = le_advertising_event->Advertising_Report[0].Address[3];
                        SERVER_REMOTE_BDADDR[4] = le_advertising_event->Advertising_Report[0].Address[4];
                        SERVER_REMOTE_BDADDR[5] = le_advertising_event->Advertising_Report[0].Address[5];

                        /* The device has been found - scan may be stopped */
                        aci_gap_terminate_gap_proc(GAP_GENERAL_DISCOVERY_PROC);
                        break;

                      default:
                        break;
                    }
                  }
                  break;

                case AD_TYPE_SERVICE_DATA: /* service data 16 bits */
                  break;

                default:
                  break;
              } /* end switch adtype */
              k += adlength + 1;
            } /* end while */

          } /*end if ADV_IND */
          break;

        default:
          break;
      }
    }
    break; /* HCI_EVT_LE_META_EVENT */

    case EVT_VENDOR:
      blue_evt = (evt_blue_aci*) event_pckt->data;

      switch (blue_evt->ecode)
      {
        case EVT_BLUE_GAP_PROCEDURE_COMPLETE:
        {
          aci_gap_proc_complete_event_rp0 *gap_evt_proc_complete = (void*) blue_evt->data;
          /* CHECK GAP GENERAL DISCOVERY PROCEDURE COMPLETED & SUCCEED */
          if (gap_evt_proc_complete->Procedure_Code == GAP_GENERAL_DISCOVERY_PROC)
          {
            if( gap_evt_proc_complete->Status != BLE_STATUS_SUCCESS )
            {
              APP_DBG_MSG("-- GAP GENERAL DISCOVERY PROCEDURE FAILED\n");
            }
            else
            {
              BSP_LED_Off(LED_BLUE);

              /*if a device found, connect to it, device 1 being chosen first if both found*/
              if (BleApplicationContext.DeviceServerFound != NO_DEVICE_FOUND)
              {
                APP_DBG_MSG("-- GAP GENERAL DISCOVERY PROCEDURE COMPLETED\n");
                UTIL_SEQ_SetTask(1 << CFG_TASK_CONN_DEV_1_ID, CFG_SCH_PRIO_0);
              }
              else
              {
                APP_DBG_MSG("-- GAP GENERAL DISCOVERY PROCEDURE COMPLETED WITH NO DEVICE FOUND\n");
              }
            }
          }
        }
        break; /* EVT_BLUE_GAP_PROCEDURE_COMPLETE */

        case EVT_BLUE_GAP_PAIRING_CMPLT:
          APP_DBG_MSG("Pairing complete \n");
          UTIL_SEQ_SetEvt(1 << CFG_IDLEEVT_GAP_PROC_COMPLETE);
          break;

        case EVT_BLUE_GAP_PASS_KEY_REQUEST:
          APP_DBG_MSG("respond to the passkey request\n");
          aci_gap_pass_key_resp(BleApplicationContext.BleApplicationContext_legacy.connectionHandle, 111111);
        break;
        
        case (EVT_BLUE_GAP_NUMERIC_COMPARISON_VALUE):
          APP_DBG_MSG("Hex_value = %ld\n",
                      ((aci_gap_numeric_comparison_value_event_rp0 *)(blue_evt->data))->Numeric_Value);

          aci_gap_numeric_comparison_value_confirm_yesno(BleApplicationContext.BleApplicationContext_legacy.connectionHandle, 1); /* CONFIRM_YES = 1 */

          APP_DBG_MSG("\r\n\r** aci_gap_numeric_comparison_value_confirm_yesno-->YES \n");
          break;

        case EVT_BLUE_GATT_TX_POOL_AVAILABLE:
          DTS_App_TxPoolAvailableNotification();
          break;

        default:
          break;
      }

        default:
          break;
  }
  return (SVCCTL_UserEvtFlowEnable);
}

const uint8_t* BleGetBdAddress( void )
{
  uint8_t *otp_addr;
  const uint8_t *bd_addr;
  uint32_t udn;
  uint32_t company_id;
  uint32_t device_id;

